{
	"arr_creations": [
		{ 
			"title": "Diablo Necromancer Costume",
			"finish_pic": "assets/necro/full_costume.jpg",
			"overview": "I find costume making really fascinating, and decided to try my hand at it. The construction is mostly foam, but has body filler, resin, and sewn fabric parts too. I had spent a little time in a workshop before taking this project on, but part of the appeal was that it would make me work in a number of different mediums if I wanted to achieve quality results. It's definitely a \"first costume\" and has some of that \"clearly the first time they've tried this\" look compared to many well known costumers, but I'm still pretty proud of it. I learned a lot making it and it was a lot of fun. I took a bunch of pictures of the progress (when I remembered), so feel free to follow along and see how I did things. You could use the series as instructions, but since this was my first time that may not be advisable. I'm sure there are things I could do better next time.",
			"arr_parts": [
				{
					"part_name": "Bone Helm",
					"part_id": "necro_helm",
					"arr_steps": [
						{
							"step_img": "assets/necro/helm/helm_mask_v1.jpg",
							"step_desc": "Decide to jump right in after watching a few tutorials online. Rough out a mask pattern that matches your face and add straps to it on the sides and top. These pieces of foam are joined together with contact cement. I use contact cement for all of my foam joints, but I've been told hot glue can work as a reasonable replacement. It's just harder to get a nice seam with hot glue."
						},
						{
							"step_img": "assets/necro/helm/helm_dremel_mistakes.jpg",
							"step_desc": "I was new at using a rotary tool. I made a bunch of mistakes when trying to round over edges, but they won't matter so long as we take care of them later. Remember that you can make mistakes as you go."
						},
						{
							"step_img": "assets/necro/helm/helm_mask_v1_salvage.jpg",
							"step_desc": "Determine that you don't actually know better than the experts and just salvage what you can from your original strappy prototype to use for the mask proper. The plan is to make this fit with a little room for glasses to avoid needing to wear contacts, so we can probably make the mask a separate piece."
						},
						{
							"step_img": "assets/necro/helm/helm_brow_bulk.jpg",
							"step_desc": "Faces aren't flat, so we need to add some dimension. Plop some extra foam on there. This is cheap floor mat foam, so it's textured on one side. The plan will be to grind in the general shapes we want, so we'll be getting rid of that undesirable texture shortly."
						},
						{
							"step_img": "assets/necro/helm/helm_brow_clean.jpg",
							"step_desc": "Grind off all that texture and give the edges some shape with a rotary tool. This is still a pretty chunky face, so we'll want to do a little more shaping."
						},
						{
							"step_img": "assets/necro/helm/helm_brow_shape.jpg",
							"step_desc": "Grind in even more. Get some definition on the bridge of the nose and the brow. The transition to the flush faces of the mask is pretty messy, but we'll clean it up later. At this point we're just aiming for good enough."
						},
						{
							"step_img": "assets/necro/helm/tooth_plan.jpg",
							"step_desc": "This mask/helmet will have teeth along the bottom ridge to mimic the top part of the mouth. Normal people teeth aren't all the same size and shape, but this is presumably the skull of some demon, so we'll make a template in card stock and use it to make our teeth kind of even. We can make them look a little less precise later."
						},
						{
							"step_img": "assets/necro/helm/tooth_trace.jpg",
							"step_desc": "Use our nifty template to draw out some teeth. This is one area where having a symmetrical mask will really help. I also drew out a larger nose cavity since the one I had looked a little too dainty."
						},
						{
							"step_img": "assets/necro/helm/tooth_ridge_plan.jpg",
							"step_desc": "Draw out some guides for carving in the ridges found underneath the top lip. At this stage it looks ridiculous. I was pretty convinced I was about to ruin it, but I kept going to see if I could prove myself wrong."
						},
						{
							"step_img": "assets/necro/helm/tooth_ridge_carve.jpg",
							"step_desc": "Use that trusty rotary tool with a roundish bit on the end and carve in those face ridges. It looks a little less dumb. All may not be lost."
						},
						{
							"step_img": "assets/necro/helm/tooth_carve.jpg",
							"step_desc": "Continue on with a small bit in the rotary tool and rough in the outlines of the teeth. I didn't chop off the gaps between the points at this point because they're providing some stability. Last thing I wanted was to mangle one of the teeth on the mask by accident in one of the coming steps and then have to do some foam surgery to correct it."
						},
						{
							"step_img": "assets/necro/helm/cheek_depth.jpg",
							"step_desc": "While we still have the face smooshed mostly flat, let's bulk up the cheeks and use the rotary tool to grind them down into a shape we like. This was done the same way as the brows and I didn't have a particular strategy other than grinding at it until it looked roughly right."
						},
						{
							"step_img": "assets/necro/helm/mask_curve.jpg",
							"step_desc": "There are times when working with foam feels magical. This was one of those times. You can heat foam up with a heat gun pretty easily. If you get a good uniform heat, you can get all kinds of complex curves into them that the foam will hold when it cools. The teeth and ridges looked considerably better once I'd put some of that curvature into the mask."
						},
						{
							"step_img": "assets/necro/helm/helm_base.jpg",
							"step_desc": "Now it's time to work on the base. Follow Evil Ted's foam helmet tutorial and make a nice little cap that fits your dome really well. I punched some holes in with a soldering iron where I thought my horns would go. Turns out those holes didn't work very well, but making perfect holes with a soldering iron works really well in foam."
						},
						{
							"step_img": "assets/necro/helm/helm_mask_extend.jpg",
							"step_desc": "As I mentioned, we want room for glasses in this helmet, so we need to extend the mask away from the dome of the cap. Pop a little spacer in at whatever level the mask will join with the foam cap."
						},
						{
							"step_img": "assets/necro/helm/helm_mask_attach.jpg",
							"step_desc": "Now you can cement the mask (with the spacer) to the helmet base itself."
						},
						{
							"step_img": "assets/necro/helm/helm_mask_strap2.jpg",
							"step_desc": "The mask is quite a ways away from the skull cap, so we need to add more foam straps (cemented on their edges) to make our new outside layer."
						},
						{
							"step_img": "assets/necro/helm/helm_mask_strap4.jpg",
							"step_desc": "Add even more straps. The foam means we can put some curve into it. Also notice that it's easier to remove the texture on one side of the foam while it's still flat, so I'm doing that up to the ends before I cement the straps in. Why did I leave the ends of the straps textured? Simply because grinding at the end of the foam often resulted in the foam jumping around and the bit of the rotary tool would chew up my nice, clean gluing surface."
						},
						{
							"step_img": "assets/necro/helm/helm_strap_gap.jpg",
							"step_desc": "The straps won't line up nicely at the back unless you're better at this than I am. We can fill them in with more foam."
						},
						{
							"step_img": "assets/necro/helm/helm_gap_fill.jpg",
							"step_desc": "A few custom foam chunks fill those gaps nicely."
						},
						{
							"step_img": "assets/necro/helm/helm_gap_clean.jpg",
							"step_desc": "Now that the chunks have been glued in, I can rough grind the texture off them. It's not pretty, but we can clean everything up later."
						},
						{
							"step_img": "assets/necro/helm/helm_pattern_gap2.jpg",
							"step_desc": "The two edges at the side that are missing straps aren't really going to benefit from more straps. I figured I'd make a couple custom pieces to fill those gaps, and to do that I did some very rough patterning. I taped some paper over it and used a pen to feel around for the edge of the foam. After I had that, I could cut it out. Repeat 3 more times (2 gaps that each needed front and back) and you're in business. While I tried to keep the helmet as symmetrical as possible, the straps weren't exactly the same size, so I couldn't reuse the template from the right on the left."
						},
						{
							"step_img": "assets/necro/helm/helm_gap.jpg",
							"step_desc": "Once the piece is traced from your template, cut out of foam and had a bunch of the texture sanded off, it's time to heat it up and use your knee to dish it. This will make it easier to glue into place since it's already stretched the way it needs to be. You can dry fit it in the helmet between heatings to see how you're doing on mimicing the shape."
						},
						{
							"step_img": "assets/necro/helm/helm_horn_hole_plan.jpg",
							"step_desc": "Glue those gap filler pieces in once they're all dished. You'll notice all kinds of black sharpie lines across my foam. I use those as registration marks and whenever possible I will maintain them all the way from initial pattern to final, shaped foam cut. Gluing in place exactly where you want is pretty easy when you have the registration marks since you just need to connect them. Go slow so you can get your seams just right. Contact cement doesn't mess around and you're not going to be able to remove it easily."
						},
						{
							"step_img": "assets/necro/helm/helm_trim_back.jpg",
							"step_desc": "The back, bottom edge of the helm looks awful as a hard, rectangular edge, so we plot out a line to trim it back and curve it a bit."
						},
						{
							"step_img": "assets/necro/helm/helm_back_clean.jpg",
							"step_desc": "The rotary tool makes short work of the curve."
						},
						{
							"step_img": "assets/necro/helm/helm_side_plan.jpg",
							"step_desc": "There are still some hard edges in here so we'll want to clean them up with our rotary tool."
						},
						{
							"step_img": "assets/necro/helm/helm_side_clean.jpg",
							"step_desc": "There! That's a bunch better. there are some sizeable gaps, but we'll solve those through other means."
						},
						{
							"step_img": "assets/necro/helm/horns_pattern.jpg",
							"step_desc": "Helmet's looking good so we'll get some big ol' goat horns underway. Start with a super fancy pattern for a super long triangle."
						},
						{
							"step_img": "assets/necro/helm/horns_layer1.jpg",
							"step_desc": "Cut out the foam for the horns so you have 2 layers for each horn. Then you can clue them back to back with a straightened coat hanger in the middle. The tip can be right at the tip of the triangle, but you'll want some serious excess at the base so you can mount them to the helmet."
						},
						{
							"step_img": "assets/necro/helm/horns_layer2.jpg",
							"step_desc": "Cut out some smaller triangles (just one set per horn). These will go near the bottom of each of the horns. You'll want to grind off the edges to give you a more rounded set of horns."
						},
						{
							"step_img": "assets/necro/helm/horns_wire_wrap.jpg",
							"step_desc": "Take a smaller wire and wrap it around the horn. The coat hanger on the inside will give it some rigidity, but the wire wrapped around the horn will give you more rigidity once you've curved the horns."
						},
						{
							"step_img": "assets/necro/helm/horns_base_angle.jpg",
							"step_desc": "The foam will naturally form a 90 degree angle at the base. That's not something I wanted, so I cleaned up the edge to let it lie on an angle."
						},
						{
							"step_img": "assets/necro/helm/horns_wire_tuck.jpg",
							"step_desc": "Make sure the wire is safely tucked away. You don't want any sharp edges hanging around. Poke the wire into the foam to keep it from poking you!"
						},
						{
							"step_img": "assets/necro/helm/horns_curve.jpg",
							"step_desc": "Twist and pry a nice curve into those horns."
						},
						{
							"step_img": "assets/necro/helm/horns_curve_match.jpg",
							"step_desc": "Then do it again to the other horn so they roughly match!"
						},
						{
							"step_img": "assets/necro/helm/horns_ridges.jpg",
							"step_desc": "Take some thinner craft foam and cut it into strips. Then go from bottom to top with a slight overlap. This should give you some cool ridges It's pretty important to do this after you put the curve in or it won't line up right. The curve can still be refined a bit afterwards, but not too much."
						},
						{
							"step_img": "assets/necro/helm/horns_glue_tip.jpg",
							"step_desc": "I recommend gluing the tip with some hot glue before you do the layers. This should help keep the other point of the wire out of harms way."
						},
						{
							"step_img": "assets/necro/helm/helm_horn_hole_fill.jpg",
							"step_desc": "With the horns mostly sorted, we should probably fix up where they'll attach to the helmet. Add in some fillers from some more custom cut foam."
						},
						{
							"step_img": "assets/necro/helm/helm_horn_hole_glue.jpg",
							"step_desc": "Pop those fillers in."
						},
						{
							"step_img": "assets/necro/helm/helm_horn_socket_plan.jpg",
							"step_desc": "Now we want some bulk where the horns meet the helmet, so we'll pattern out a rough ring of foam to circle the horn socket."
						},
						{
							"step_img": "assets/necro/helm/helm_horn_socket_glue.jpg",
							"step_desc": "Clean up that ring of foam with the rotary tool and glue it down."
						},
						{
							"step_img": "assets/necro/helm/helm_heat_treat.jpg",
							"step_desc": "Sanding at foam give it a really undesirable texture and opens the cells of the foam. We want them closed for paint and other finishing products to take to it. One effective approach is to heat treat the foam by blasting it with a torch or a heat gun."
						},
						{
							"step_img": "assets/necro/helm/helm_heat_treat2.jpg",
							"step_desc": "Heat treat the whole thing. It'll still be pretty rough, but it'll be smoother."
						},
						{
							"step_img": "assets/necro/helm/helm_horn_socket_test.jpg",
							"step_desc": "Pop those horns into the sockets. They should be a pretty tight fit. We've used contact cement for most joins here, but hot glue will suffice for this one."
						},
						{
							"step_img": "assets/necro/helm/helm_horn_wire_anchor.jpg",
							"step_desc": "Now that they're secured, we can add some extra pressure to hold them steady from the inside. Twist the coat hanger wire around with some needle-nosed pliers and cut them off. Some foam between them and your head will definitely be appreciated after."
						},
						{
							"step_img": "assets/necro/helm/helm_resin_cure.jpg",
							"step_desc": "Now that the foam shaping is done, we can move to doing some finishing. First step is to give some rigidity to just the outside. I opted for some resin. Cheap resin is fine since I don't need it for a finish so much as just for a hard coat. I used fiberglass resin. Resin is really, really bad for you to breathe, so be sure to wear a proper respirator."
						},
						{
							"step_img": "assets/necro/helm/helm_resin_cure2.jpg",
							"step_desc": "It's important to get pretty thorough coverage. I did two coats. Thin coats are better than thick coats. That's a recurring theme with applying anything from resin to paint. You may see that I have a few blobs here from where the coat was too thick. We can sand those down later."
						},
						{
							"step_img": "assets/necro/helm/helm_bondo1.jpg",
							"step_desc": "Why did we want a rigid coat on top of the foam? Why weren't we concerned about the dings and scrapes? Simple. Now we're going to load up on auto body filler. You mix up the two parts and spread it like putty. Remember what I said about thin coats? Yeah. Do that. Definitely don't go as thick as you can see I did. That took a LOT of sanding to bring down and smooth again."
						},
						{
							"step_img": "assets/necro/helm/helm_bondo1_2.jpg",
							"step_desc": "So much body filler. It's really versatile because you can spread it and sand it. This is a very good thing, because I put on way too much on and will need to sand a lot of it off. What I said about the resin goes twofold for auto body filler. It's REALLY bad to breathe in. Get that respirator out again."
						},
						{
							"step_img": "assets/necro/helm/helm_bondo1_3.jpg",
							"step_desc": "All of the fiddly little bits can be filled out with auto body filler. The advice about the thin coats goes double for smaller and more fragile parts, like the horns."
						},
						{
							"step_img": "assets/necro/helm/helm_bondo1_sand.jpg",
							"step_desc": "Now to pay the price for putting too much on in one coat. Lots of sanding to do before adding another coat of filler. Sanding isn't very fun, but it's the best way to get results. This is just between coats, so a high grit isn't needed yet."
						},
						{
							"step_img": "assets/necro/helm/helm_bondo2.jpg",
							"step_desc": "Pop on a new coat of auto body filler. A flexible scraper like a business card or even a piece of foam will spread the filler more cleanly (and thinly)."
						},
						{
							"step_img": "assets/necro/helm/helm_bondo2_2.jpg",
							"step_desc": "Get it on the face as well. We want bondo all over as it lets us get some better detail work in."
						},
						{
							"step_img": "assets/necro/helm/helm_bondo2_sand.jpg",
							"step_desc": "Now it's time for more sanding."
						},
						{
							"step_img": "assets/necro/helm/helm_bondo2_sand2.jpg",
							"step_desc": "And even more sanding."
						},
						{
							"step_img": "assets/necro/helm/helm_bondo2_sand3.jpg",
							"step_desc": "And yet more sanding. This should smooth out a lot of the imperfections we left in."
						},
						{
							"step_img": "assets/necro/helm/helm_prime1.jpg",
							"step_desc": "Now for priming!"
						},
						{
							"step_img": "assets/necro/helm/helm_prime2.jpg",
							"step_desc": "Prime everywhere. Get it in all the nooks and crannies of the outside surface."
						},
						{
							"step_img": "assets/necro/helm/helm_prime3.jpg",
							"step_desc": "Lots of thin coats makes the magic happen."
						},
						{
							"step_img": "assets/necro/helm/helm_prime4.jpg",
							"step_desc": "There. All primed. It's starting to look better already!"
						},
						{
							"step_img": "assets/necro/helm/helm_tooth_paint.jpg",
							"step_desc": "Now it's time for doing some painting and weathering. Get some black dirt on the teeth in the grooves."
						},
						{
							"step_img": "assets/necro/helm/helm_fit_adjust.jpg",
							"step_desc": "After a test fit, discover that it's just a bit too snug now. Likely from the resin, filler and heat treating. Carve out some of the insides for a better fit and pop some foam on the coat hanger wire to protect your noggin."
						},
						{
							"step_img": "assets/necro/helm/helm_horn_paint_base.jpg",
							"step_desc": "The horns are a different colour than the helm, so with some very brushy strokes, add a light brown. The brush strokes will just help the horn texture."
						},
						{
							"step_img": "assets/necro/helm/helm_horn_paint_ridge.jpg",
							"step_desc": "With a darker shade of brown, add some more brushy strokes to the pits under the ridges of the horns. This should give it some more character."
						},
						{
							"step_img": "assets/necro/helm/helm_horn_paint_ridge2.jpg",
							"step_desc": "It's important to add that darker shade of brown very carefully. Paint really makes the piece come alive."
						},
						{
							"step_img": "assets/necro/helm/helm_horn_paint_ridge3.jpg",
							"step_desc": "Another perspective to see the details in the horns."
						},
						{
							"step_img": "assets/necro/helm/helm_light_weather.jpg",
							"step_desc": "Get some of that light brown in the nooks of the face and teeth. Clean and fresh props seldom look as convincing as worn ones, and this one's made of a skull. I think it could do with more paint, but for now we will call it good enough."
						}
					]
				}
			]
		}
	]
}