{
	"arr_projects": [
		{
			"left": true,
			"title": "YoWorld",
			"link": "http://www.bigvikinggames.com/yoworld/",
			"studio": "Big Viking Games",
			"preview": "https://www.bigvikinggames.com/wp-content/uploads/2014/11/BVGYoWorldWebsite_PallinYos-Smaller.png",
			"desc": "YoWorld is a social game on Facebook focusing on player social interactions and player generated experiences, both in character customization and in decorating fantastic digital spaces.",
			"arr_highlights": [
				"Lead a team of developers on a mix of features and tending a legacy project",
				"Growing to senior programmer and then to a leadership role",
				"Work on everything from content generation tools, to analytics, to features, to bug fixes, to customer service tools, to data management.",
				"Developing a product for a large player base",
				"Growing internal talent and interviewing new talent"
			]
		},
		{
			"title": "Dark Heroes",
			"link": "https://www.bigvikinggames.com/dark-heroes/",
			"studio": "Big Viking Games",
			"preview": "https://www.bigvikinggames.com/wp-content/uploads/2014/11/DH_IpadAppStore_Breck_1334x750.jpg",
			"desc": "A science fiction CCG built in web tech wrapped in a mobile app.",
			"arr_highlights": [
				"Leading the team to meet our ship date",
				"Working in app-wrapped web tech that allowed for very fast turnaround on feature development",
				"Developing tools to support the game"
			]
		},
		{
			"left": true,
			"title": "Tiny Kingdoms",
			"link": "https://www.bigvikinggames.com/tiny-kingdoms/",
			"studio": "Big Viking Games",
			"preview": "https://s3.amazonaws.com/ksr/assets/000/907/039/18603f651edfd5f35ee948a9f25ab3e3_large.png?1378824323",
			"desc": "Tiny Kingdoms was a playful, fantasy, turn-based, strategy, web game. It featured both PvP and PvE elements and was built as one of the studio's first HTML5 titles.",
			"arr_highlights": [
				"Developing a game entirely in web tech with rendering entirely in the canvas",
				"Working with the proprietary web game engine",
				"Though my time was short on this game, collaborating with the artists on such a light-hearted game was excellent"
			]
		},
		{
			"title": "Kingdoms CCG",
			"link": "https://www.kingdomsccg.com/",
			"studio": "Antic Entertainment",
			"preview": "https://cdn.mmohuts.com/wp-content/uploads/2015/03/Kingdoms_CCG_604x423.jpg",
			"desc": "Kingdoms CCG is a high fantasy collectible card game inspired by popular tabletop equivalents. Card combat was augmented with powerful hero characters the player chose for each deck, along with lane mechanics to split up the battlefield.",
			"arr_highlights": [
				"Being involved in the earliest stages and taking the game from a blank file to a working prototype",
				"Pen-and-paper prototyping potential cards",
				"Developing a robust AI system for allowing the computer to play arbitrary future cards intelligently that is still in use today",
				"Collaborating with the team on the design of the cards",
				"Building out the architecture for the product"
			]
		},
		{
			"left": true,
			"last": true,
			"title": "Platoonz",
			"link": "",
			"studio": "Antic Entertainment",
			"preview": "https://i.ytimg.com/vi/hit-tCdsBZk/maxresdefault.jpg",
			"desc": "A side scrolling combat game with plenty of upgrades and wacky gear loadouts.",
			"arr_highlights": [
				"My first dive into professional game development",
				"Feature development, both client and server side",
				"Got to be involved in design decisions",
				"Ported the game to mobile with Adobe Air"
			]
		}
	]
}